src/ПодсистемаPAPI/Catalogs/PAPI_КаналыИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>PAPI_КаналыИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ПодсистемаPAPI/Catalogs/PAPI_КаналыИнтеграции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Направление) Тогда 
		Объект.Направление = "Получение";
	КонецЕсли;	
	
	Если Метаданные.СервисыИнтеграции.Количество() > 0 Тогда 
		
		Для Каждого СервисИнтеграции Из Метаданные.СервисыИнтеграции Цикл 
			
			Элементы.Сервис.СписокВыбора.Добавить(СервисИнтеграции.Имя,СервисИнтеграции.Имя);
			
		КонецЦикла;	
			
		СервисПриИзмененииНаСервере();

	КонецЕсли;    
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СервисПриИзменении(Элемент)
	
	СервисПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)

	СервисПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СервисПриИзмененииНаСервере()
	
	Если Элементы.Канал.СписокВыбора.Количество() > 0 Тогда
		
		Элементы.Канал.СписокВыбора.Очистить();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Направление) Тогда 
		
		Объект.Направление = "Получение";
		
	КонецЕсли;
	
	текСервис = Метаданные.СервисыИнтеграции.Найти(Объект.Сервис);
			
	Если текСервис <> Неопределено Тогда 
		
		КаналаСервисаИнтеграцииОтправка = Метаданные.СвойстваОбъектов.НаправлениеСообщенияКаналаСервисаИнтеграции[Объект.Направление];   
		
		Для Каждого текКаналСервиса Из текСервис.КаналыСервисаИнтеграции Цикл 
					
			Если текКаналСервиса.НаправлениеСообщения = КаналаСервисаИнтеграцииОтправка Тогда 
						
				Элементы.Канал.СписокВыбора.Добавить(текКаналСервиса.Имя, текКаналСервиса.Имя);				
						
			КонецЕсли;
					
		КонецЦикла;
				
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
